tutorials/fallingFilm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamMultiRun;

regionSolvers
{
    film            multicomponentFilm;
    fluid           multicomponentFluid;
}

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   1.0;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;

maxDeltaT       0.01;

libs
(
   "libuserfilmMassTransfer.so"
   "libusermulticomponentFilm.so"
   "libuserinterphaseMassTransferModels.so"
);

functions
{
    #include "massFlowRates"
}

// ************************************************************************* //
