tutorials/fallingFilm/constant/fluid/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bulkMassTransfer
{
    type                bulkMassTransfer;
    
    select              all;
    
    transferPatch       film; // Name of patch on which mass transfer occurs
        
    specie              CO2; // Name of specie to transfer
    
    // Mass transfer model type (options: constant, physical)
    interphaseMassTransferModel constant;
    
    // Coefficients for constant mass transfer model
    constantCoeffs
    {
        // Interfacial mass transfer rate (kg/m^2/s)
        // Negative = transfer from bulk to film
        // Positive = transfer from film to bulk
        transferRate        -1e-4;
    }
}

// ************************************************************************* //
