tutorials/fallingFilm/0/fluid/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.68;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(top|outlet|film)"
    {
        type            zeroGradient;
    }

    "(left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
